async def start_text():
    text = [
        "🤖 <b>Привіт студенте!</b>\n",
        "Мене звати <b>Рудеус</b>, я працюю в колцентрі.",
        "Визвонюю прогульщиків і нагадую їм про пари.\n",
        "💠Більше про мою роботу можеш дізнатись натиснувши меню.",
        "💠А щоб дізнатись більше про мене, тисни дод. інформація.\n",
        "Побачимось за 5 хвилн перед парою 😉"
    ]
    return '\n'.join(text)

async def menu_text():
    text = [
        "⚙️ Для докладної інформації тисніть <u>Інструкція</u>",
    ]
    return '\n'.join(text) 

async def info_text():
    text = [
        "🌀 Трішки про мене\n",
        "Я бот розробленим струдентом КПІ. Моє основне завдання нагадувати вам про ваші пари, тому що пропускаючи пару ви наражаєте себе на небезпеку. Небезпеку відправитись на допку. Ви можете дізнатись як мною користуватись 😏 перейшовши в пунк <b>меню</b> або визвавши його командою <code>/menu</code>. Оскільки мій хазяїн не дуже розумний, може трапитись різне. Тому ви можете використати команду <code>/report</code> щоб повідомити про якусь проблему зі мною, чи з моїм другом сайтом. На цьому у мене все! Приємного навчання 😉"
    ]
    return '\n'.join(text)

async def instr_text():
    text = [
        "📖 <b>Інструкція</b>\n",
        "🔹<code>/web</code> - повертає посилання на сайт, з якого бот бере розклад.",
        "Перейдіть на цей сайт, вкажіть там свою групу та заповніть розклад. Ту ж саму групу що вказували на сайті, вкажіть боту командою <u>set</u>.",
        "<b>❗️ВАЖЛИВО❗️</b> Перед тим як змінити відображуваний тиждень натисніть зберегти, інакше введену інформацію буде втрачено",
        "🔹<code>/set</code> - прикриплює групу до чату.",
        "🔹<code>/get</code> - цією командою можна перевірити яка група закріплена в чаті.",
        "🔹<code>/remove</code> - відкріплює групу від чату.",
        "<i>Важливо зазначити, бот надсилатиме повідомлення якщо за чатом закріплена група, і не надсилатиме якщо група не була закріплена, або розклад групи не був заповнений.</i>",
        "🔹<code>/emoji</code> - написавши цю команду ви можете включати/виключати відправку ботом стікерів. За замовчуванням увімкнене.",
    ]
    return '\n'.join(text)

texts = {
    "start": start_text,
    "menu": menu_text,
    "info": info_text,
    "instr": instr_text,
}